[
    {
        "name": "DEPRECATED - BI and Metrics",
        "description": "DEPRECATED - Business Intelligence and Metrics",
        "code": "BIM",
        "id": 2000,
        "parentId": 24000,
        "concrete": false,
        "deprecated": true,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "DEPRECATED - Ops Data",
        "description": "DEPRECATED - Operations Managed Data",
        "code": "OPS",
        "id": 7000,
        "parentId": 24000,
        "concrete": false,
        "deprecated": true,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Unknown",
        "description": "Unknown Data Type",
        "code": "UNKNOWN",
        "id": 19000,
        "parentId": null,
        "concrete": false,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": true
    },
    {
        "name": "DEPRECATED - Unstructured",
        "description": "DEPRECATED - Unstructured Data",
        "code": "UNSTRUCTURED",
        "id": 20000,
        "parentId": 24000,
        "concrete": false,
        "deprecated": true,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Legacy Types",
        "description": "Legacy data types",
        "code": "LEGACY",
        "id": 24000,
        "parentId": null,
        "concrete": false,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Settlement & Transaction Data",
        "description": "Contains data related to the settlement process as well as data about Transactions including Payments and Security Transfers.",
        "code": "uri.intranet.db.com/edm/C121",
        "id": 30000,
        "parentId": null,
        "concrete": false,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Settlement Obligation",
        "description": "Settlement Obligation means the cashflow or Product Instance flow  that needs to be settled. It is enriched with the Standing Settlement Instructions.",
        "code": "uri.intranet.db.com/edm/C34",
        "id": 30100,
        "parentId": 30000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Expected Flow",
        "description": "The aggregation of Theoretical Cash (receivables and payables)  through the settlement infrastructure process to create an expected settlement amount constructed of either gross or netted cash flows.",
        "code": "uri.intranet.db.com/edm/C5",
        "id": 30200,
        "parentId": 30000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "DEPRECATED - Settlement Posting Entry",
        "description": "Settlement Posting Entry means a specific cash or security movement (credit or debit amount) posted to a specific account at a specific date/time. These will typically affect the account position (balances).",
        "code": "uri.intranet.db.com/edm/C35",
        "id": 30300,
        "parentId": 30000,
        "concrete": true,
        "deprecated": true,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Standing Settlement Instruction",
        "description": "Standing Settlement Instructions means the client-provided account details e.g. specifying where their cash account is held for a specific currency",
        "code": "uri.intranet.db.com/edm/C31",
        "id": 30400,
        "parentId": 30000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Accounting & Financial Data",
        "description": "Subject area including accounting and financial data, such as postings to the general ledger and to subledgers as well as balances for those ledgers.",
        "code": "uri.intranet.db.com/edm/C111",
        "id": 31000,
        "parentId": null,
        "concrete": false,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Organisation Data",
        "description": "Subject area that includes the management accounting hierarchy of UBR, Trading Desk, Book Portfolio and Book and associated data classes",
        "code": "uri.intranet.db.com/edm/C116",
        "id": 32000,
        "parentId": null,
        "concrete": false,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Book",
        "description": "Book means an accounting book comprising a set of trades/business (group of financial assets within a Front Office Trade Capture System) that are either:\r\n\r\n(i) not actively traded (generally held to maturity) and not usually affected by market activity (Banking Book) or \r\n(ii) regularly traded and are valued by market performance (Trading Book).\r\n\r\nNote that Book in the EDM corresponds to the concept of 'Master Book' and not 'System Book'",
        "code": "uri.intranet.db.com/edm/C10",
        "id": 32100,
        "parentId": 32000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "UBR",
        "description": "UBR (UnternehmensBereichsRechnung, or Corporate Division Accounting) represents a level within DB's management (as opposed to financial) accounting hierarchy, generally reflecting DB's organisational structure.",
        "code": "uri.intranet.db.com/edm/C6",
        "id": 32200,
        "parentId": 32000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "DB Legal Entity",
        "description": "DB Legal Entity means an incorporated entity that is owned and operated by Deutsche Bank.",
        "code": "uri.intranet.db.com/edm/C15",
        "id": 32300,
        "parentId": 32000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "DB Organisational Unit",
        "description": "DB Organisational Unit means a recognised, internal part of (or subdivision of) DB there for management and control purposes. A DB Organisational Unit is not a legal entity.  Example types of Unit include business division, control function, bank branch, head office, office, business unit, team, data centre.",
        "code": "uri.intranet.db.com/edm/C73",
        "id": 32400,
        "parentId": 32000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Party Data",
        "description": "Subject area including Party-related data classes.  Note that agreement data has been separated out into a new subject area.",
        "code": "uri.intranet.db.com/edm/C117",
        "id": 33000,
        "parentId": null,
        "concrete": false,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Party",
        "description": "A Party is any entity which is able to perform a formal business Party role: an individual, a corporation, a partnership, an association, a joint-stock company, a business trust, or an unincorporated organisation.  At the EDM level, details such as addresses should be considered part of Party. Note that this data class should be considered to include Party financial information.",
        "code": "uri.intranet.db.com/edm/C11",
        "id": 33100,
        "parentId": 33000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Customer",
        "description": "The Customer Party Purpose represents all Parties eligible to be a Participant in a Deal or Transaction (directly or indirectly). Some examples:\r\n- a Party trading on its own account\r\n- a Party trading on its own account who has requested segregation through a Party Unit\r\n- a Party acting on behalf of another Party e.g. a fund manager acting for a fund\r\n- a Party acting on behalf of another Party who has requested segregation through a party unit.\r\n\r\nA Customer corresponds to the retail banking concept of a business partner.  A Customer can therefore play many roles including Client, Attorney, Collateral Provider or Guarantor”.",
        "code": "uri.intranet.db.com/edm/C8",
        "id": 33200,
        "parentId": 33000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Legal Agreement",
        "description": "A Legal Agreement means a legally enforceable bespoke and recorded in written form (either paper or electronically) agreement between DB and another party - which may be internal - that involves the exchange of assets or services, and creating obligations enforceable by law.\r\nLegal Agreement can be:\r\n- a distillation of information from one or more documents\r\nand/or\r\n- associated to physical or electronic documents.\r\nLegal Agreement is an abstract type which is implemented, for example, by a specialised agreement e.g. Master Client Agreement, Netting Agreement, Contract of Employment and so on, and may be constructed from a variety of parts, such as Clauses, Terms and so on, and be related to other Legal Agreements, such as Legal Amendments, Annexes and so on.",
        "code": "uri.intranet.db.com/edm/C63",
        "id": 33300,
        "parentId": 57084,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Deal & Position Data",
        "description": "Contains data related to Deals, which are agreements to provide a specific product or service to a client.  This area also covers the data class called Product Instance, which describes the economic details of a financial arrangement.  For example, it describes the basis on which the cash flows for an interest rate swap or for a loan are calculated.    (For a listed product, a Product Instance will identify the relevant Instrument Static data that describes the share, bond, etc.  The actual details of the Instrument Static data are not included in this subject area).",
        "code": "uri.intranet.db.com/edm/C123",
        "id": 34000,
        "parentId": null,
        "concrete": false,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "DEPRECATED - Transaction - DO NOT USE",
        "description": "Transaction means the record of an activity between two or more parties to exchange goods, services or financial instruments.",
        "code": "uri.intranet.db.com/edm/C101",
        "id": 34100,
        "parentId": 34000,
        "concrete": false,
        "deprecated": true,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "DEPRECATED - Transfer",
        "description": "Transfer means the anticipated flow of cash, or of a security, resulting from a Transaction.  Transfer and Position Effect may seem to be similar but if we consider a cancellation transaction, then in this case  the Transfer amount would be the same as the original transaction (since it just records the economic effects of the transaction).  However, the Position Effect in this case would be equal and opposite to that of the original trade.",
        "code": "uri.intranet.db.com/edm/C68",
        "id": 34200,
        "parentId": 34000,
        "concrete": false,
        "deprecated": true,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Position",
        "description": "Position means the quantifiable interest that the Bank or a Customer has in terms of cumulative assets or obligations with respect to a given Product Instance",
        "code": "uri.intranet.db.com/edm/C9",
        "id": 34300,
        "parentId": 34000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Position Effect",
        "description": "Position Effect means the amount by which a Position in a Product Instance or in cash will move as the result of a Deal Event.  In other words, a Position can always be calculated by aggregating the relevant Position Effects.",
        "code": "uri.intranet.db.com/edm/C66",
        "id": 34400,
        "parentId": 34000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Credit Facility",
        "description": "Credit Facility means an agreement under which a defined amount of credit is extended to a borrower for a specific period of time",
        "code": "uri.intranet.db.com/edm/C20",
        "id": 34500,
        "parentId": 37100,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "DEPRECATED - Risk & Valuation Data",
        "description": "DEPRECATED -  Subject area including data classes related to risk and valuation",
        "code": "uri.intranet.db.com/edm/C119",
        "id": 35000,
        "parentId": null,
        "concrete": false,
        "deprecated": true,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Risk Position",
        "description": "Risk Position means the aggregated level at which Measures are calculated. Depending on product, this can be one-to-one with the trading position, e.g. Loan, or many-to-one with trading positions, e.g. Interest rate swap.  For example, for an interest rate swap we have a single Position, but two Risk Positions, one for the floating rate interest stream and one for the fixed rate stream.",
        "code": "uri.intranet.db.com/edm/C25",
        "id": 35100,
        "parentId": 49384,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Model Cashflow",
        "description": "Cash based on underlying trade economics and valuation models as perceived by the front office or alternative risk models. Forward schedule of cash made up of: \r\n      a. known cash flows\r\n      b. implied cash flows \r\n\r\nCreated by front office risk infrastructure.",
        "code": "uri.intranet.db.com/edm/C26",
        "id": 35200,
        "parentId": 49384,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Pricing Model",
        "description": "Pricing Model means a component with a defined methodology written and maintained by the appropriate people as required by the Bank, on which a financial instrument is designed & modelled in a proprietary way to generate a set of prices and risk measures.",
        "code": "uri.intranet.db.com/edm/C14",
        "id": 35300,
        "parentId": 49384,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Market Data Item",
        "description": "Market Data Item means price and trade-related data for a financial instrument reported by a trading venue, thereby allowing traders and investors to know the latest price and see historical trends for instruments such as equities, fixed-income products, derivatives and foreign exchange rates for currencies.  Note - includes Market Data Taxonomy information.\r\n\r\nThis should be understood to include curves and surfaces as well as individual prices..",
        "code": "uri.intranet.db.com/edm/C4",
        "id": 35400,
        "parentId": 57584,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "DEPRECATED - Risk Measure",
        "description": "Risk Measure means the result of a calculation performed by an analytics tool for a risk position",
        "code": "uri.intranet.db.com/edm/C12",
        "id": 35500,
        "parentId": 48984,
        "concrete": false,
        "deprecated": true,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Calculation Context",
        "description": "Calculation Context means the qualifying information that describes a particular calculation run (e.g. by a Front Office Risk Producer application) including whether it is an end-of-day run and what scenario, if any, it is linked to.",
        "code": "uri.intranet.db.com/edm/C27",
        "id": 35600,
        "parentId": 49384,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Collateral Data",
        "description": "Contains data related to how risk is mitigated through the allocation of assets as collateral.  It also covers the collateral management process whereby additional collateral is requested or provided, or collateral is returned.",
        "code": "uri.intranet.db.com/edm/C112",
        "id": 36000,
        "parentId": null,
        "concrete": false,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "DEPRECATED - Collateral Position",
        "description": "Collateral Position means a portfolio of assets pledged thru the Collateral Agreement as collateral by the client and valued to generate collateral requirements.",
        "code": "uri.intranet.db.com/edm/C18",
        "id": 36100,
        "parentId": 36000,
        "concrete": false,
        "deprecated": true,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Collateral Valuation",
        "description": "Collateral Valuation means the fair value of the asset used as collateral.",
        "code": "uri.intranet.db.com/edm/C33",
        "id": 36200,
        "parentId": 36000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Collateral Call",
        "description": "Collateral Call means the amount of new or additional collateral that is required according to calculations based on the existing Collateral Position and relevant Measures.",
        "code": "uri.intranet.db.com/edm/C17",
        "id": 36300,
        "parentId": 36000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "DEPRECATED - Collateral Call Response",
        "description": "Collateral Call Response means the entity that provides the means for either the giver party to post Collateral against the Collateral Requirements or the taker party to receive Collateral against the requested Collateral Requirements.",
        "code": "uri.intranet.db.com/edm/C24",
        "id": 36400,
        "parentId": 36000,
        "concrete": false,
        "deprecated": true,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Product Type Data",
        "description": "Subject area including data related to Product Types, such as the pRDS catalogue of product type information.",
        "code": "uri.intranet.db.com/edm/C118",
        "id": 37000,
        "parentId": null,
        "concrete": false,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Product Instance",
        "description": "A Product Instance describes the economic details of a financial arrangement such as a Deal or Product Agreement.  For example, it describes the basis on which the cash flows for an interest rate swap or for a loan are calculated.    For a listed product, a Product Instance will simply identify the relevant Instrument Static data that describes the share, bond, etc.",
        "code": "uri.intranet.db.com/edm/C106",
        "id": 37100,
        "parentId": 34000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Product Type",
        "description": "A Product Type represents a set of services or transactions offered to clients in order to generate revenue or mitigate risk, and can be catalogued/defined at varying levels of granularity for different purposes of management (e.g. Risk Management, Client Fulfilment, Financial Reporting, Model Risk Control etc).  For example, \"Equity Share\" could be a Product Type which represents ordinary shares such as Vodafone or IBM.",
        "code": "uri.intranet.db.com/edm/C7",
        "id": 37200,
        "parentId": 37000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Theoretical Flow",
        "description": "Cash with no concept of fails, delayed payments and netting. Represents known cash flows as implied by the authoritative source of Deals. Created with authoritative Deal store/associated cash generation engine.",
        "code": "uri.intranet.db.com/edm/C23",
        "id": 37300,
        "parentId": 34000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Trading Venue",
        "description": "Trading Venue means a physical or virtual marketplace (exchange, trading platform, regulated/non-regulated market or trade reporting facility) operating within a jurisdiction where categories of financial instrument (/commodity) might be listed, priced and bought/sold.",
        "code": "uri.intranet.db.com/edm/C42",
        "id": 37400,
        "parentId": 57484,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Technology Data",
        "description": "Subject area which covers technology-related data.",
        "code": "uri.intranet.db.com/edm/C122",
        "id": 38000,
        "parentId": null,
        "concrete": false,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "DEPRECATED - Legacy Technology Data",
        "description": "DEPRECATED - ?",
        "code": "EDM_TECHNOLOGY_DATA",
        "id": 38100,
        "parentId": 24000,
        "concrete": false,
        "deprecated": true,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Common Data",
        "description": "Subject area including commonly used data classes such as Country and Currency",
        "code": "uri.intranet.db.com/edm/C113",
        "id": 39000,
        "parentId": null,
        "concrete": false,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Calendar",
        "description": "Calendar means a named group of calendar-dates and times for organising days for social, religious, commercial or administrative purposes (for example UK Public Holiday Calendar, NYSE Holiday Calendar)..",
        "code": "uri.intranet.db.com/edm/C16",
        "id": 39100,
        "parentId": 39000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Country",
        "description": "Country means an identifiable area of land with its own government and official borders. Typically limited to those recognised by the United Nations and so listed under ISO 3166-1.",
        "code": "uri.intranet.db.com/edm/C2",
        "id": 39200,
        "parentId": 39000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Currency",
        "description": "Currency means a system of money circulated within an economy, providing a store of value and used as a medium of exchange.",
        "code": "uri.intranet.db.com/edm/C3",
        "id": 39300,
        "parentId": 39000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Region",
        "description": "Region means a defined area of the world, typically spanning multiple countries, country subdivisions, towns and/or sub-regions but not always with fixed boundaries. \r\n\r\nFor example, continents, subcontinents, geographical zones, administrative regions (e.g. EMEA) and sub-regions (e.g. Nordic).",
        "code": "uri.intranet.db.com/edm/C1",
        "id": 39400,
        "parentId": 39000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Industry and Sector",
        "description": "Industry means the classification that categorises organisations and financial instruments based on their production-processes, products and/or behaviour in financial markets. Example schemes include NACE, NAICS and UKSIC.",
        "code": "uri.intranet.db.com/edm/C74",
        "id": 39500,
        "parentId": 39000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "DEPRECATED - Legal & Compliance Data",
        "description": "Subject area including legal and compliance-related data such as Policy, Regulation and Legal Matters.",
        "code": "uri.intranet.db.com/edm/C114",
        "id": 40000,
        "parentId": null,
        "concrete": false,
        "deprecated": true,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Order & Execution Data",
        "description": "An Order means a request to buy or sell a security at the market price or the specified price; an Execution is an Order that has been partially or fully filled.  This subject area also covers the application of Allocation Instructions to Executions, resulting in one or more Deals being created.",
        "code": "uri.intranet.db.com/edm/C115",
        "id": 40100,
        "parentId": null,
        "concrete": false,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Sales Data",
        "description": "Subject area included data related to sales - includes CRM data, marketing campaign data and data about sales teams.  (However, data about the actual parties involved would form part of the Party subject area).",
        "code": "uri.intranet.db.com/edm/C120",
        "id": 40600,
        "parentId": null,
        "concrete": false,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Account Balance",
        "description": "Account Balance is an intraday, end-of-day, month-end or other view of the position of a Financial Account.",
        "code": "uri.intranet.db.com/edm/C93",
        "id": 41000,
        "parentId": 31000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Derived Risk & Capital Measure",
        "description": "A Derived Risk & Capital Measure represents a risk measure or capital measure derived and published by Finance.  (For example, Finance publish derived credit-risk related measures calculated at the Deal or Position level of granularity).",
        "code": "uri.intranet.db.com/edm/C94",
        "id": 41100,
        "parentId": 48684,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Chart of Accounts",
        "description": "Chart of Accounts is the set of Financial Accounts (i.e. the balance sheet accounts and the PnL accounts) used to describe the financial health of the Organisation and form the basis for the preparation of the Organisation’s Financial Statements.",
        "code": "uri.intranet.db.com/edm/C88",
        "id": 41200,
        "parentId": 31000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Financial Account",
        "description": "Financial Account is a ledger within the Financial Accounting function in an Organisation, specifically a Global Account (detailing the Organisation’s assets, liabilities, owner's equity, revenue, expenses, gains and losses) or a Local Account (subledger).",
        "code": "uri.intranet.db.com/edm/C90",
        "id": 41300,
        "parentId": 31000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Financial Statement Item",
        "description": "Financial Statement Item is a core General Ledger financial accounting category within DB’s consolidation/reporting environment, used in the preparation of (consolidated) financial statements. Financial Statement Items cover Balance Sheet, PnL, as well as additional statistics.\r\nAlso includes Regional Financial Items.",
        "code": "uri.intranet.db.com/edm/C89",
        "id": 41400,
        "parentId": 31000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Posting",
        "description": "A Posting is a double-sided entry (credit and debit amount) to two Financial Accounts which will (typically) affect the Account Balance.",
        "code": "uri.intranet.db.com/edm/C92",
        "id": 41500,
        "parentId": 31000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Posting Rule Set",
        "description": "Posting Rule Set is a set of business rules that determine the appropriate postings needed to reflect a particular event (such as a new or amended transaction or the marking-to-market of a Position).",
        "code": "uri.intranet.db.com/edm/C91",
        "id": 41600,
        "parentId": 31000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "DEPRECATED - Loan Collateral",
        "description": "Loan Collateral means the loan borrower makes an asset available to the lender in case of defaulting on the loan, and the borrower secures a more favourable rate as the lender has less risk.",
        "code": "uri.intranet.db.com/edm/C32",
        "id": 42100,
        "parentId": 36000,
        "concrete": false,
        "deprecated": true,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Control",
        "description": "A Control is an activity that assists the implementation of a policy or procedure to ensure\r\n• Mitigating actions or initiatives are applied against the firm’s risk(s) in order to reduce the impact and frequency of such risk(s) occurring.\r\n• Both firm and management objectives are achieved.\r\nControl activities occur throughout the organization, at all levels and in all functions. Controls can be described as performed by someone, for a purpose, at specific time (trigger point or interval i.e. daily, weekly, monthly) with specific outcomes. The activities involve (but not limited to) approvals, authorizations, verifications, reconciliations, reviews of operating performance, security or assets and segregation of duties.",
        "code": "uri.intranet.db.com/edm/C96",
        "id": 42300,
        "parentId": 49784,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Finding",
        "description": "A Finding is an output from a review of an area that highlights a gap with a rule or policy.",
        "code": "uri.intranet.db.com/edm/C98",
        "id": 42600,
        "parentId": 39000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Forecast",
        "description": "A Forecast is a prediction of the quantity of a resource or asset at some future point in time.  A Forecast can be financial or can predict the availability of another resource, for example the number of people available to work on a particular scheduled  task.  This class should also be considered to include the record of actual values that transpired for the forecast quantity.",
        "code": "uri.intranet.db.com/edm/C97",
        "id": 42700,
        "parentId": 39000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Change Initiative",
        "description": "Data relating to programmes within the bank, including plans, risks, roadmaps, initiatives etc.",
        "code": "uri.intranet.db.com/edm/C99",
        "id": 42900,
        "parentId": 39000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Allocation",
        "description": "Allocation means the application of an Allocation Instruction from a Party to a succesful, (or partially successful), Execution of an Order, resulting in one or more Trades being created.",
        "code": "uri.intranet.db.com/edm/C58",
        "id": 43100,
        "parentId": 40100,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Allocation Instruction",
        "description": "Allocation Instruction means a request to assign all or part of the quantity of a Trade to one or more Customer Accounts.",
        "code": "uri.intranet.db.com/edm/C22",
        "id": 43200,
        "parentId": 40100,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Execution",
        "description": "Execution means an order that has partially or fully filled. Risk starts from the point of Execution.",
        "code": "uri.intranet.db.com/edm/C41",
        "id": 43300,
        "parentId": 40100,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Order",
        "description": "Order means a request to buy or sell a security at the market price or the specified price.",
        "code": "uri.intranet.db.com/edm/C40",
        "id": 43400,
        "parentId": 40100,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Quote",
        "description": "Quote means the quoted price for a product instance",
        "code": "uri.intranet.db.com/edm/C44",
        "id": 43500,
        "parentId": 40100,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Request for Quote",
        "description": "Request for Quote means a client request for a price to potentially buy or sell a product.",
        "code": "uri.intranet.db.com/edm/C43",
        "id": 43600,
        "parentId": 40100,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Book Portfolio",
        "description": "Book Portfolio means a group of related (accounting) Books, managed by a given Trading Desk.\r\n\r\nNote that a Book Portfolio may have a Trading Desk as a parent or another Book Portfolio, but not both.",
        "code": "uri.intranet.db.com/edm/C54",
        "id": 43800,
        "parentId": 32000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Charge Centre",
        "description": "Charge Centre represents a ledger underpinning DB's management accounting hierarchy (UBR) to keep track of operating-costs/expenses of a Party or Organisational Unit (e.g. a Team of people) in an area/function/aspect of DB that might generate revenue and might incur costs.",
        "code": "uri.intranet.db.com/edm/C55",
        "id": 43900,
        "parentId": 32000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Trading Desk",
        "description": "Trading Desk means a place, team or platform where orders of a particular Financial Instrument/Commodity can be executed (bought/sold) either automatically or with the assistance of traders/dealers. \r\n\r\nDesks oversee, manage and group Portfolios of (Trading/Banking) Books.\r\n\r\nNote that a Trading Desk may have another Trading Desk as parent or a UBR, but not both.",
        "code": "uri.intranet.db.com/edm/C13",
        "id": 44200,
        "parentId": 32000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Contractual Arrangement",
        "description": "Contractual Arrangement means a set of Legal Agreements and Documents and process records that form the set of legal terms and process evidence that apply to a business relationship in a certain context (e.g. for certain products or for certain booking entities or for certain roles). It may be composed of multiple Legal Agreements (e.g. such as a Master Client Agreement plus a Collateral Agreement, a Contract of Employment plus a Confidentiality Agreement plus a copy of a Passport plus records of the on-boarding process).",
        "code": "uri.intranet.db.com/edm/C83",
        "id": 44400,
        "parentId": 57084,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Document",
        "description": "Document is documentary evidence that is a representation of legal, official or contractual information (under the jurisdiction of law) that is of interest to DB.  This is limited to documents that are directly associated to our dealings with internal and external parties (including natural persons) and certain sub-entities (that have separate regulatory capacity from their owning party e.g. foreign bank branches).  A document, which could be physical or electronic, can be either:\r\n- a negotiated document, such as a trading agreement or a contract of employment\r\nor\r\n- a non-negotiated document required to support our business processes (e.g. on-boarding, KYC), but does not form part of the contractual arrangement. This would include, for example, evidence of a client's tax status or an employee's passport or visa.",
        "code": "uri.intranet.db.com/edm/C71",
        "id": 44600,
        "parentId": 57084,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Participant",
        "description": "Participant means an actor who participates in a Deal or in a Product Instance.  Using this construct allows us to model, for example, Book-to-Book deals and client deals in the same way.  May include guarantors, issuers, borrowers and so on.",
        "code": "uri.intranet.db.com/edm/C70",
        "id": 44700,
        "parentId": 34000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Party Purpose",
        "description": "Party Purpose is the reason that a Party is in the process of engaging (i.e. during on-boarding) or is able to engage (i.e. once on-boarded) with DB.",
        "code": "uri.intranet.db.com/edm/C80",
        "id": 44900,
        "parentId": 33000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "DEPRECATED - Party Role to Party Role Relationship",
        "description": "Party Role to Party Role Relationship means a declared (and evidenced)  inter-party-role relationship.",
        "code": "uri.intranet.db.com/edm/C85",
        "id": 45000,
        "parentId": 33000,
        "concrete": false,
        "deprecated": true,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Party to Party Relationship",
        "description": "A Party To Party Relationship represents a relationship between two or more parties.  A relationship may be externally recognised (e.g. an existing relationship between a customer and agent, a parent - child relationship, a membership of an informal organisation, or a node in a legal hierarchy) or internally recognised (e.g. a node in a risk, credit or sales hierarchy).",
        "code": "uri.intranet.db.com/edm/C28",
        "id": 45100,
        "parentId": 33000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "DEPRECATED - Party Unit",
        "description": "Party Unit means a defined party subdivision, requested by the party themselves, to assist them in conducting business with DB.  This enables the party to segregate their transactions into one or more buckets for various internal purposes (such as their settlement and revenue recording processes). These segregations are client driven (and in place purely to facilitate client side reporting) so do not materially impact DB processing and how DB represents/reports transactions within (for example) our control functions such as Finance, Risk and Treasury.",
        "code": "uri.intranet.db.com/edm/C29",
        "id": 45200,
        "parentId": 33000,
        "concrete": false,
        "deprecated": true,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "System Account Identifier",
        "description": "System Account Identifier means the local identifier that is used in a particular system to represent an Account.",
        "code": "uri.intranet.db.com/edm/C30",
        "id": 45300,
        "parentId": 33000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Asset",
        "description": "Asset means a non-financial item (such as property or other item of value) that may be used, for example, as collateral or as the subject of a lease.",
        "code": "uri.intranet.db.com/edm/C79",
        "id": 45400,
        "parentId": 57484,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Clearing Venue",
        "description": "Clearing Venue means a provider of clearing and settlement services within a jurisdiction and for particular payment types and particular categories of exchange-traded/OTC financial instruments and commodities. Includes Central Counterparty clearing houses (CCP).",
        "code": "uri.intranet.db.com/edm/C64",
        "id": 45500,
        "parentId": 57484,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Interest or Charge Tariff",
        "description": "Interest or Charge Tariff means the (standard or negotiated) interest rates or charge rates/amounts agreed for a product instance. Tariffs are used to calculate interest and charges over a defined period of time.",
        "code": "uri.intranet.db.com/edm/C38",
        "id": 45600,
        "parentId": 37000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Instrument Identifier",
        "description": "Instrument Identifier means the identifier assigned to a product instance when it is securitised and / or listed on a Trading Venue",
        "code": "uri.intranet.db.com/edm/C49",
        "id": 45800,
        "parentId": 57484,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "DEPRECATED - Product Instance to Product Instance Relationship",
        "description": "Defines the relationship between one Product Instance and another.  For example, the underlier for an equity derivative, or the target equity for a convertible bond, or the constituents of a covered bond.",
        "code": "uri.intranet.db.com/edm/C100",
        "id": 45900,
        "parentId": 37000,
        "concrete": false,
        "deprecated": true,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Rating",
        "description": "Rating means the allocation of a specific measure of credit quality (both rating and outlook) assigned to a given party, security, country or loan/credit facility, highlighting the likelihood (over a specified time horizon) of credit being repaid in full and on time.",
        "code": "uri.intranet.db.com/edm/C50",
        "id": 46100,
        "parentId": 49084,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Calculation Context Population",
        "description": "Calculation Context Population means the population (e.g. of Deals and market data) that is included in a particular calculation run.",
        "code": "uri.intranet.db.com/edm/C61",
        "id": 46500,
        "parentId": 49384,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Credit Limit",
        "description": "Credit Limit means a defined value (often the maximum value), over a defined period, for some credit-related quantity such as credit exposure.",
        "code": "uri.intranet.db.com/edm/C21",
        "id": 46600,
        "parentId": 49084,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Loss",
        "description": "Loss means a provisional or actual amount of value lost.  Note that this class represents the kind of losses that Operational Risk might track, rather than trading PnL",
        "code": "uri.intranet.db.com/edm/C95",
        "id": 46700,
        "parentId": 49784,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Measure Type",
        "description": "Measure Type means the definition of a specific measure including the name, the associated dimensions (such as tenor) and  information on how the measure is calculated.",
        "code": "uri.intranet.db.com/edm/C59",
        "id": 46900,
        "parentId": 48984,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "DEPRECATED - Settlement Account",
        "description": "Settlement Account means either a securities account or a cash account used for settlement.",
        "code": "uri.intranet.db.com/edm/C39",
        "id": 47500,
        "parentId": 30000,
        "concrete": true,
        "deprecated": true,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Settlement Instruction",
        "description": "Settlement Instruction means an instruction to a settlement system to transfer cash or other assets (e.g. instructing a clearing system to make a payment).",
        "code": "uri.intranet.db.com/edm/C69",
        "id": 47600,
        "parentId": 30000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Party Account",
        "description": "Party Account is a way of grouping together Deals or Transactions for a Customer Party Purpose  (where the Customer can be the Principal on its own, or the Principal and its representatives collectively).  A Party Account is used as a reference for the Customer acting as a Participant in Deals or Transactions that need to be considered together.  A Customer may have more than oneParty Account.  Note that Party Account is a logical construct and may not correspond to a system account in any particular computer system.  (Compare with Banking Account which is an account that supports tracking the balance of a Product Instance, or supports the operational processes around provision of products to clients).",
        "code": "uri.intranet.db.com/edm/C36",
        "id": 48000,
        "parentId": 33000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Deal",
        "description": "A Deal is an agreement between a customer and the bank to provide a specific product or service to client.  A Deal may involve creation of a Product Instance (e.g. structured derivative or syndicated loan) that covers the specifications from the customer. A Deal is composed of one or more Deal Obligations, with each Deal Obligation relating to a different Product Instance involved in the Deal.\r\nNote that this class also represents pipeline Deals.  These are Deals at very early stages of development, progressing from sales idea to bids (discussed with client). The end of the pipeline Deal’s life cycle is a signed contractual agreement between Deutsche Bank and Client legal entity.",
        "code": "uri.intranet.db.com/edm/C102",
        "id": 48200,
        "parentId": 34000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Payment Instruction",
        "description": "Payment Instruction means an order to move a specified amount of funds between a specified source and target cash account, on a specified date and time (and typically with a specified value date).  \r\n\r\nThis may be either a one-off item (e.g. resulting from the presentation of a cheque) or automatically generated through a rule or regular payment mandate (e.g. resulting from a standing order set against the source cash account). \r\n\r\nPayment Instructions will generate formal cash payments via the most appropriate delivery mechanism (e.g. Book-to-Book, SEPA, BACS) within the DB payment systems.  Sometimes known as Client Instruction.",
        "code": "uri.intranet.db.com/edm/C72",
        "id": 48300,
        "parentId": 47600,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Payment Mandate",
        "description": "Payment Mandate means a predefined payment template for a (potential/future) movement of funds between a specified source and target cash account. \r\n\r\nTypically put in place to facilitate one-off or ad-hoc individual payment instructions, or scheduled (regular) and/or rule-based (event driven) individual payment instructions (such as standing order and direct debit mandates).",
        "code": "uri.intranet.db.com/edm/C65",
        "id": 48400,
        "parentId": 34000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Collateral Coverage",
        "description": "Collateral Coverage is the link between the Collateral Agreement and what that agreement is \"securing\".",
        "code": "uri.intranet.db.com/edm/C165",
        "id": 48401,
        "parentId": 36000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Organisation",
        "description": "An organisation is an entity, such as an institution, fund, corporation, community or an association, that has a collective goal and is linked to an external environment. A unique entity that is legally or financially responsible for the performance of financial transactions or has the legal right in its jurisdiction to enter independently into legal contracts, regardless of whether it is incorporated or constituted in some other way (e.g. trust, partnership, contractual). This excludes natural persons, but includes governmental and supranational organisations.",
        "code": "uri.intranet.db.com/edm/C87",
        "id": 48402,
        "parentId": 33100,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Periodic Charge Booked",
        "description": "Periodic charge means the record of applying a fee or charge to an account that is levied periodically. (Eg. a quarterly fee for providing a particular kind of cash account).",
        "code": "uri.intranet.db.com/edm/C76",
        "id": 48403,
        "parentId": 48468,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Discovery Request",
        "description": "Data relating to the discovery, collection, storage and delivery of electronically stored information primarily for the purposes of supporting litigation, regulatory, governmental, or internal investigations to an internal or external requestor.",
        "code": "uri.intranet.db.com/edm/C143",
        "id": 48404,
        "parentId": 63984,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Global Chart of Accounts",
        "description": "Global Chart of Accounts is the suite of Financial Accounts used to describe the financial health of the whole Organisation and form the basis for the preparation of the Organisation’s Financial Statements.",
        "code": "uri.intranet.db.com/edm/C104",
        "id": 48405,
        "parentId": 41200,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Sensitivity Measure",
        "description": "Sensitivity Measure means a Risk Measure which represents the sensitivity of the value of a position to movements in one of the factors that determine value, An example of such a factor might be the price of the underlying security for a derivative.  Examples of Sensitivity Measure include Delta and Gamma.",
        "code": "uri.intranet.db.com/edm/C126",
        "id": 48406,
        "parentId": 55484,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Cost Centre",
        "description": "Cost Centre represents a type of Charge Centre, a ledger underpinning DB's management accounting hierarchy (UBR) to keep track of operating-costs/expenses of a Person or Organisational Unit (e.g. a Team of people) in an area/function/aspect of DB that typically does not (directly) generate revenue.",
        "code": "uri.intranet.db.com/edm/C57",
        "id": 48407,
        "parentId": 43900,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Global Account",
        "description": "A Global Account is a general ledger Financial Account listed within the Global Chart of Accounts, used to post financial accounting transactions against (via Postings) and to track Account Balances.  Forms the basis for the preparation of the DB’s Financial Statements.",
        "code": "uri.intranet.db.com/edm/C110",
        "id": 48408,
        "parentId": 41300,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Legal Matter",
        "description": "See Legal Matter Business Glossary Term.  (A Legal Matter is a work package undertaken by DB Legal or external Legal Counsel pertaining to a specific legal position or to garner advice or opinion regarding a legal position.  Legal Matters may range from minor amendments to a standard NDA through to multi-year litigation cases. Legal Matters in the context of the Legal Data Council also refers to tendering, vendor selection, time management and billing for external Legal Counsel activity).",
        "code": "uri.intranet.db.com/edm/C142",
        "id": 48409,
        "parentId": 63984,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Give Up",
        "description": "Give Up means a Deal Event that represents the event where a client moves an execution from an executing broker to the client clearing broker",
        "code": "uri.intranet.db.com/edm/C53",
        "id": 48410,
        "parentId": 48478,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Prospect",
        "description": "A Prospect is a Party that has no formal agreement with DB, but who is a key interest to DB, for example as potential seller or buyer.\r\nAn important distinction between a Prospect and a Customer is in the amount of information that may be kept and for what period of time.\r\nWhile a Party might be a Prospect for one DB Legal Organisation, the same Party could have another Party Purpose with the same or alternative DB Organisation.",
        "code": "uri.intranet.db.com/edm/C169",
        "id": 48411,
        "parentId": 33000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Vendor",
        "description": "A Vendor is a Legal Organisation with a Party Purpose with the intent to provide products and/or services (e.g. software package, consultants (as Contingent Workers)).",
        "code": "uri.intranet.db.com/edm/C135",
        "id": 48412,
        "parentId": 33000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Drawdown",
        "description": "Drawdown means a Deal Event which represents the borrowing of cash by a Customer from an existing facility",
        "code": "uri.intranet.db.com/edm/C51",
        "id": 48413,
        "parentId": 48478,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Personal Documents & Communication Data",
        "description": "Personal documents & files created by a user, actual communications data generated by a user, and the metadata about a communication or document.",
        "code": "uri.intranet.db.com/edm/C158",
        "id": 48414,
        "parentId": 38000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Worker",
        "description": "A Worker is a Party Purpose of a Natural Person to provide services to DB. A Worker can be either a Contingent Worker (working through a Service Company which may be a Service Provider or Vendor) or an Employee of DB.",
        "code": "uri.intranet.db.com/edm/C136",
        "id": 48415,
        "parentId": 33000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Alert",
        "description": "An Alert is a signal that a condition has arisen indicating potential or actual non-compliance with a business rule, policy or regulation.\r\nNote that IT Alerts, (e.g. an alert indicating low available disk space), are categorised separately.",
        "code": "uri.intranet.db.com/edm/C172",
        "id": 48416,
        "parentId": 39000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "DEPRECATED - Strategy & Architecture",
        "description": "Principles, standards, taxonomies (such as this), capabilities",
        "code": "uri.intranet.db.com/edm/C144",
        "id": 48417,
        "parentId": 39000,
        "concrete": false,
        "deprecated": true,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Service & Support",
        "description": "Data relating to the service and support of an asset, including contracts, SLAs, requests, incidents & changes.",
        "code": "uri.intranet.db.com/edm/C151",
        "id": 48418,
        "parentId": 38000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Policy",
        "description": "A Policy determines normative statements, minimum standards and guidelines for Employees and/or concerning organisational matters, based on or in alignment with laws, regulations and other internal requirements.",
        "code": "uri.intranet.db.com/edm/C137",
        "id": 48419,
        "parentId": 63984,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Record Retention",
        "description": "The data which describes the minimum and maximum length of time  for which records must be kept according to the legal and regulatory requirements to which Deutsche Bank is subject to. It may also indicate other specific requirements relating to retention such as whether a physical record is required; information security aspects related to storage and any technical aspects to storage or specific disposal requirements. The Records Retention data should aid and inform decision making with regards to the archiving, maintenance and disposal of information or data.",
        "code": "uri.intranet.db.com/edm/C139",
        "id": 48420,
        "parentId": 63984,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "DEPRECATED - Debt Instrument",
        "description": "Debt Instrument means an instrument, such as a government bond, that enables the issuing party to raise funds by promising to repay a lender in accordance with terms of a contract.",
        "code": "uri.intranet.db.com/edm/C77",
        "id": 48421,
        "parentId": 37100,
        "concrete": false,
        "deprecated": true,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Liquidity Measure",
        "description": "Liquidity Measure means a Risk Measure related to liquidity such as Liquidity Coverage Ratio.",
        "code": "uri.intranet.db.com/edm/C129",
        "id": 48422,
        "parentId": 49584,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Contact",
        "description": "The Contact is a Party with the Party Purpose to act as a Contact between DB and other Parties. The Contact may or may not be a Worker or be legally defined as having controlling or beneficial position with Parties introduced to DB.",
        "code": "uri.intranet.db.com/edm/C170",
        "id": 48423,
        "parentId": 33000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Security Transfer",
        "description": "Security Transfer means the record of an amount of a Product Instance transferred into and out of an account. Each ‘transfer in’ to an account is associated with a respective ‘transfer out’ of another account, and vice versa.",
        "code": "uri.intranet.db.com/edm/C176",
        "id": 48424,
        "parentId": 48468,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Self-Identified Issue",
        "description": "A Self-Identified Issue is an output from an internal review of an area that highlights a gap with a rule or policy.",
        "code": "uri.intranet.db.com/edm/C168",
        "id": 48425,
        "parentId": 42600,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Engagement",
        "description": "Engagement is an agreement for a Natural Person to act as a Worker for DB in a specified HR Position, backed by a legal agreement appropriate for the type of Worker, and the method of provision of service or services.",
        "code": "uri.intranet.db.com/edm/C162",
        "id": 48426,
        "parentId": 33000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Location",
        "description": "Location means a description of a physical location. A Location can be made up of a single or multiple parts e.g. one or more of an address, a location within a building, a floor, a desk location in an office, a name of a meeting room, and so on.",
        "code": "uri.intranet.db.com/edm/C157",
        "id": 48427,
        "parentId": 39000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Computing Resources",
        "description": "The platform on which an applications or software runs, specifically the CI rather than the technology or operating system.  Includes physical and virtual servers & desktops, containers, etc.  For example “UKLONVD810668”.",
        "code": "uri.intranet.db.com/edm/C146",
        "id": 48428,
        "parentId": 38000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Customer Interaction",
        "description": "Customer Interaction means the cross-channel history of records of customer contacts. This can be inbound (customer contacting the Bank) or outbound (Bank contacting the customer).   Interaction covers calls, meetings, chats, roadshow events and also covers visiting a website or other electronic interaction for the client. It can also be used to reference future interactions (i.e. planned meetings or registrations for meetings).",
        "code": "uri.intranet.db.com/edm/C153",
        "id": 48429,
        "parentId": 40600,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "IT Products & Technology",
        "description": "The products/services offered by the CTO function within the business and the technology underpinning them. (Note that these are not in any way financial products that are offered to clients.). Software licenses are included here.",
        "code": "uri.intranet.db.com/edm/C152",
        "id": 48430,
        "parentId": 38000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Netting Agreement",
        "description": "Netting Agreement means the legal agreement that sets out the terms that define what exposures may be netted across counterparties.",
        "code": "uri.intranet.db.com/edm/C107",
        "id": 48431,
        "parentId": 33300,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "DEPRECATED - Fund",
        "description": "Fund means a supply of capital belonging to numerous investors that is used to collectively purchase investments while each investor retains ownership and control of his or her own shares.  Includes Exchange Traded Products (ETPs).",
        "code": "uri.intranet.db.com/edm/C78",
        "id": 48432,
        "parentId": 37100,
        "concrete": false,
        "deprecated": true,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "DEPRECATED - Equity Derivative",
        "description": "Equity Derivative means a Derivative Instrument whose value is at least partly derived from one or more underlying equity securities.",
        "code": "uri.intranet.db.com/edm/C48",
        "id": 48433,
        "parentId": 37100,
        "concrete": false,
        "deprecated": true,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "AFC Alert",
        "description": "An AFC Alert is a signal that an AFC-related condition has arisen indicating potential or actual non-compliance with a business rule, policy or regulation.",
        "code": "uri.intranet.db.com/edm/C171",
        "id": 48434,
        "parentId": 63684,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Operational Control",
        "description": "An Operational Control is any recurring control that supports running the Bank.",
        "code": "uri.intranet.db.com/edm/C178",
        "id": 48435,
        "parentId": 42300,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Contingent Worker",
        "description": "Contingent Worker is the form of a Natural Person's engagement with DB when that party is contracted by DB to perform work under a contract for services. A Contingent Worker typically operates in a business-to-business relationship, is not paid through PAYE but through invoicing for services rendered, and do not have the employment rights and responsibilities of an Employee.",
        "code": "uri.intranet.db.com/edm/C160",
        "id": 48436,
        "parentId": 48415,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Audit Finding",
        "description": "An Audit Finding is an output from an audit of an area that highlights a gap with a rule or policy.",
        "code": "uri.intranet.db.com/edm/C175",
        "id": 48437,
        "parentId": 42600,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Record Disposal",
        "description": "Data relating to the actions to be taken to fulfil the requirements outlined in the retention schedule to destroy or transfer records.",
        "code": "uri.intranet.db.com/edm/C140",
        "id": 48438,
        "parentId": 63984,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Collateral Agreement",
        "description": "Collateral Agreement means a legal document that regulates credit support (collateral) for Deals.  An example is a Credit Support Annex.",
        "code": "uri.intranet.db.com/edm/C108",
        "id": 48439,
        "parentId": 33300,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "DEPRECATED - Rate Derivative",
        "description": "Rate Derivative means a product family which is based on interest rates.",
        "code": "uri.intranet.db.com/edm/C46",
        "id": 48440,
        "parentId": 37100,
        "concrete": false,
        "deprecated": true,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Profit & Loss Measure",
        "description": "Profit & Loss Measure means a measure which represents the calculated profit or loss for a position, such as Realised Profit & Loss, or Profit & Loss Attribution.",
        "code": "uri.intranet.db.com/edm/C125",
        "id": 48441,
        "parentId": 55484,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Data Stores",
        "description": "Persistent stores of data. E.g. Relational databases, NOSQL databases, flat files and so on.",
        "code": "uri.intranet.db.com/edm/C148",
        "id": 48442,
        "parentId": 38000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Regulation",
        "description": "A Regulation is a rule used to carry out a law.",
        "code": "uri.intranet.db.com/edm/C138",
        "id": 48443,
        "parentId": 63984,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Deposit",
        "description": "Deposit means a contract where an amount of cash (or cash equivalent) from one party (the depositor) is held for safekeeping, investment or day-to-day banking with another party (the deposit-taker or account-servicer).\r\n\r\nThere is an expectation that funds will be returned (or made available) to the depositor in accordance with the terms of the agreement, perhaps with agreed interest and/or service charges applied. \r\n\r\nA deposit is applicable over a specified fixed term (has a maturity date) or might be open-ended (such as a demand deposit or certain saving deposit accounts).",
        "code": "uri.intranet.db.com/edm/C75",
        "id": 48444,
        "parentId": 37100,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Product Agreement",
        "description": "Product Agreement means an agreement between DB and client where DB provides a product (such as a cash account for the client to deposit cash).",
        "code": "uri.intranet.db.com/edm/C37",
        "id": 48445,
        "parentId": 33300,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Telemetry & Capability Data",
        "description": "All types of alerts, monitoring, application KPI & performance of systems, including availability and derived state.\r\n The telemetry & capability data defines the observable information about the components of the IT landscape e.g. applications & systems and their interaction. By means of measurements data that is collected. These data contains capability information, application & infrastructure measures such as performance & availability as well as derived state information and changes of the state captured as events, alerts.",
        "code": "uri.intranet.db.com/edm/C149",
        "id": 48446,
        "parentId": 38000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Deal Initiation",
        "description": "Deal Initiation is a record of a buy or sell of a quantity of a product instance at a price for a Customer.  Entering into a Trade is a kind of Deal Initiation",
        "code": "uri.intranet.db.com/edm/C81",
        "id": 48447,
        "parentId": 48478,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Service Provider",
        "description": "A Service Provider is Legal Organisation providing services to DB.",
        "code": "uri.intranet.db.com/edm/C133",
        "id": 48448,
        "parentId": 33000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "DEPRECATED - Access & Entitlement",
        "description": "Information about the access to and roles within IT Assets.",
        "code": "uri.intranet.db.com/edm/C150",
        "id": 48449,
        "parentId": 38000,
        "concrete": false,
        "deprecated": true,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "HR Position",
        "description": "HR Position is an instantiation of a Job Profile as a defined requirement of need within a DB Organisational Unit. A Job Position can be filled via a recruitment process, resulting in one or more Natural Persons (as an individual or shared position) being engaged as a Worker.",
        "code": "uri.intranet.db.com/edm/C163",
        "id": 48450,
        "parentId": 32000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Issuer",
        "description": "An Issuer is a legal entity that develops, registers and sells securities to finance its operations. Issuers may be corporations, investment trusts, or domestic or foreign governments. Issuers are legally responsible for the obligations of the issue and for reporting financial conditions, material developments and any other operational activities as required by the regulations of their jurisdictions.",
        "code": "uri.intranet.db.com/edm/C134",
        "id": 48451,
        "parentId": 33000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Local Account",
        "description": "A Local Account is a detailed Financial Account (a subledger account) that underpins a Global Account.",
        "code": "uri.intranet.db.com/edm/C109",
        "id": 48452,
        "parentId": 41300,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Employee",
        "description": "Employee is the purpose for a Natural Person's engagement with DB when that party is contracted by DB to perform work under a contract of employment. The employment status of Employee reflects the Employee's rights and the employer's responsibilities. A Natural Person may be an Employee in employment law but have a different status for tax purposes: employers must work out each Worker’s status in both employment law and tax law. Typically an Employee differs from a Contingent Worker in that an Employee has additional employment rights and responsibilities that don't apply to Contingent Workers.",
        "code": "uri.intranet.db.com/edm/C161",
        "id": 48453,
        "parentId": 48415,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Campaign",
        "description": "Campaign is a general term for a marketing of selected products for a specific group of business partners to invoke interest.",
        "code": "uri.intranet.db.com/edm/C155",
        "id": 48454,
        "parentId": 40600,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Legal Hold & Preservation",
        "description": "Data relating to a Legal Hold Notice. This is a communication provided by Legal which  informs the recipient to preserve Records. It defines the legal matter, types of Records and the date ranges to be preserved, which results in a Record Hold.  The data class will include the request as well as any  collection of data to be held. It can also cover preservation requests for non-Legal groups such as Tax.",
        "code": "uri.intranet.db.com/edm/C141",
        "id": 48455,
        "parentId": 63984,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Operational Risk Alert",
        "description": "An Operational Risk Alert is a signal that a condition of interest to Operational Risk has arisen indicating potential or actual non-compliance with a business rule or policy",
        "code": "uri.intranet.db.com/edm/C167",
        "id": 48456,
        "parentId": 48416,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Risk Assessment",
        "description": "Risk Assessment represents artefacts explaining the probability of occurrence and severity of losses expected along a particular business",
        "code": "uri.intranet.db.com/edm/C177",
        "id": 48457,
        "parentId": 48984,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Credit Agreement",
        "description": "Credit Agreement means an agreement under which one or more Credit Facilities are extended to a borrower.",
        "code": "uri.intranet.db.com/edm/C62",
        "id": 48458,
        "parentId": 33300,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Corporate Action",
        "description": "A Corporate Action represents a Deal Event arising from a corporate event such as a merger or stock split.",
        "code": "uri.intranet.db.com/edm/C84",
        "id": 48459,
        "parentId": 48478,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Job Profile",
        "description": "Job Profile is the definition of a working role executed by a Natural Person within DB e.g. Business Analyst. The definition will include a title and description, and might also include a set of skills typically required or executed in that role.",
        "code": "uri.intranet.db.com/edm/C164",
        "id": 48460,
        "parentId": 32000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Sales Monitoring & Reporting & KPI Data",
        "description": "Sales KPI means a key performance indicator for measuring sales performance.",
        "code": "uri.intranet.db.com/edm/C154",
        "id": 48461,
        "parentId": 40600,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Compliance Alert",
        "description": "A Compliance Alert is a signal that a compliance-related condition has arisen indicating potential or actual non-compliance with a business rule,  policy or regulation.",
        "code": "uri.intranet.db.com/edm/C173",
        "id": 48462,
        "parentId": 63784,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Novation",
        "description": "Novation means the Deal Event that represents the substitution of one contract / product for another one when the counterparty changes.",
        "code": "uri.intranet.db.com/edm/C52",
        "id": 48463,
        "parentId": 48478,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Local Chart of Accounts",
        "description": "Local Chart of Accounts is a Chart of Accounts which lists a given set of Local Accounts.",
        "code": "uri.intranet.db.com/edm/C103",
        "id": 48464,
        "parentId": 41200,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "DEPRECATED - Equity",
        "description": "Equity Share means a financial instrument that represents ownership in a corporation.",
        "code": "uri.intranet.db.com/edm/C60",
        "id": 48465,
        "parentId": 37100,
        "concrete": false,
        "deprecated": true,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Deal Obligation",
        "description": "A Deal Obligation is a component of a Deal, which records an obligation for a Deal relating to a particular Product Instance.   For example, an option call spread Deal would have two Deal Obligations, each one corresponding to a call option with a different exercise price.",
        "code": "uri.intranet.db.com/edm/C156",
        "id": 48466,
        "parentId": 34000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Guarantee",
        "description": "A Guarantee is a risk mitigant provided by a counterparty which is not equal to the borrower. If the borrower is on default, the guarantor is obliged to settle the loan up to the guarantee amount.",
        "code": "uri.intranet.db.com/edm/C131",
        "id": 48467,
        "parentId": 36000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Transaction",
        "description": "Transaction means the record of the actual movement of cash or of another Product Instance.  This may be in response to an obligation resulting from a Deal Event.",
        "code": "uri.intranet.db.com/edm/C67",
        "id": 48468,
        "parentId": 30000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Hardware",
        "description": "All types of physical hardware including devices and infrastructure.  E.g. Servers, appliances, end-user devices, network hardware, switches, cards.",
        "code": "uri.intranet.db.com/edm/C145",
        "id": 48469,
        "parentId": 38000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Present Value Measure",
        "description": "Present Value Measure means a Risk Measure which represents the calculated value of a position, such as End of Day Present Value or Unconstrained Shocked Present Value.",
        "code": "uri.intranet.db.com/edm/C124",
        "id": 48470,
        "parentId": 55484,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Operational Risk Measure",
        "description": "Operational Risk Measure means a Risk Measure related to activities to gauge and report Operational Risk.",
        "code": "uri.intranet.db.com/edm/C130",
        "id": 48471,
        "parentId": 49784,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Credit Risk Measure",
        "description": "Credit Risk Measure means a Risk Measure that represents a measurement of the risk that a credit may not be repaid on full or on time, such as Exposure at Default or Collateral Valuation Adjustment.",
        "code": "uri.intranet.db.com/edm/C128",
        "id": 48472,
        "parentId": 49084,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Payment",
        "description": "Payment means the record of an amount of cash transferred into and out of an account. Each ‘transfer in’ to an account is associated with a respective ‘transfer out’ of another account, and vice versa. One of these transfers can be executed outside the Bank. Where one transfer is executed outside the Bank, the Bank generates an advice to ensure controls are implemented on the leg executed outside the branch.",
        "code": "uri.intranet.db.com/edm/C19",
        "id": 48473,
        "parentId": 48468,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Accounting Entry Posting",
        "description": "Accounting Entry Posting is a posting adjustment that is required to implement accounting practices such as multi-currency accounting or swinging and netting.",
        "code": "uri.intranet.db.com/edm/C105",
        "id": 48474,
        "parentId": 41500,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Collateral Allocation",
        "description": "Collateral Allocation records the usage as collateral of a holding in a specified asset by a particular Collateral Agreement.",
        "code": "uri.intranet.db.com/edm/C159",
        "id": 48475,
        "parentId": 36000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Compliance Finding",
        "description": "A Compliance Finding is a break in a control identified by the Compliance Testing Group.",
        "code": "uri.intranet.db.com/edm/C174",
        "id": 48476,
        "parentId": 63784,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Interest Booked",
        "description": "Interest Booked represents a calculated amount of money applied to an Account against a Product Instance that has been invested, loaned or borrowed for a certain period of time.",
        "code": "uri.intranet.db.com/edm/C82",
        "id": 48477,
        "parentId": 48468,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Deal Event",
        "description": "A Deal Event represents an event in the lifecycle of a Deal that generates one or more Position Effects.  Examples include initiation of a Deal, cancellation of a Deal and exercise of an option.",
        "code": "uri.intranet.db.com/edm/C186",
        "id": 48478,
        "parentId": 34000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Loan",
        "description": "Loan means a contract where an amount of cash (or cash equivalent) is drawn down by one party (the borrower/debtor) from a credit facility made available by another party (the lender/creditor).\r\n\r\nThere is an expectation the borrower repays the debt in accordance with the terms of the agreement, usually with agreed interest and/or service charges applied. \r\n\r\nA loan is applicable over a specified fixed term (has a maturity date) or might be more open-ended (e.g. a revolving loan product such as an overdraft or demand loan).",
        "code": "uri.intranet.db.com/edm/C45",
        "id": 48479,
        "parentId": 37100,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Natural Person",
        "description": "A Natural Person is a Party which can incur legal obligation and can be sued at law. This includes human beings beyond the age of majority in the relevant jurisdiction and legal persons created by means of some legal fiction / statutory instrument, as well as the legal persons of sovereigns and of entities created by statute or royal charter.",
        "code": "uri.intranet.db.com/edm/C86",
        "id": 48480,
        "parentId": 33100,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Profit Centre",
        "description": "Profit Centre means a ledger underpinning DB’s management accounting hierarchy (UBR) to keep track of revenue (and also operating-costs/expenses) of a person or organisational Unit (e.g. a team of people) in an area/function/aspect of DB that typically generates profit.",
        "code": "uri.intranet.db.com/edm/C56",
        "id": 48481,
        "parentId": 43900,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Market Risk Measure",
        "description": "Market Risk Measure means a Risk Measure which represents a measurement of market risk, including those calculated using probabilistic approaches such as Value at Risk and Expected Shortfall.  An example would be Scaled Stressed VaR.",
        "code": "uri.intranet.db.com/edm/C127",
        "id": 48482,
        "parentId": 49684,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "DEPRECATED - Credit Derivative",
        "description": "Credit Derivative means a product family which is based on a legal entity's credit risk.",
        "code": "uri.intranet.db.com/edm/C47",
        "id": 48483,
        "parentId": 37100,
        "concrete": false,
        "deprecated": true,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Software",
        "description": "All software business and infrastructure applications and the supporting code libraries, repositories, deployment configurations & languages.",
        "code": "uri.intranet.db.com/edm/C147",
        "id": 48484,
        "parentId": 38000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Capital Risk Data",
        "description": "Subject area including data classes related to capital risk and derived risk measures such as credit-related measures currently calculated by Finance.",
        "code": "uri.intranet.db.com/edm/C189",
        "id": 48684,
        "parentId": null,
        "concrete": false,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Common Risk Data",
        "description": "Subject area including data classes related to risk and valuation that are common across different risk areas, such as Risk Taxonomy and Risk Assessment.",
        "code": "uri.intranet.db.com/edm/C191",
        "id": 48984,
        "parentId": null,
        "concrete": false,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Credit Risk Data",
        "description": "Subject area including data classes related to credit risk.",
        "code": "uri.intranet.db.com/edm/C193",
        "id": 49084,
        "parentId": null,
        "concrete": false,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Front Office Risk Data",
        "description": "Front Office Risk Data is data about the following measures: Present Value Measures, PnL Measures and Sensitivities.  In other words, this area is concerned with calculating valuations and how those valuations change in response to different factors.",
        "code": "uri.intranet.db.com/edm/C192",
        "id": 49384,
        "parentId": null,
        "concrete": false,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Liquidity Risk Data",
        "description": "Subject area including data classes related to liquidity risk.",
        "code": "uri.intranet.db.com/edm/C188",
        "id": 49584,
        "parentId": null,
        "concrete": false,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Market Risk Data",
        "description": "Subject area including data classes related to market risk.",
        "code": "uri.intranet.db.com/edm/C187",
        "id": 49684,
        "parentId": null,
        "concrete": false,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Non-Financial Risk Data",
        "description": "Subject area including data classes related to non-financial risk, such as Operational Risk Measure.",
        "code": "uri.intranet.db.com/edm/C190",
        "id": 49784,
        "parentId": null,
        "concrete": false,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Capital Risk Limit",
        "description": "Capital Risk Limit means a defined value (often the maximum value), over a defined period, for a capital-risk related quantity.",
        "code": "uri.intranet.db.com/edm/C196",
        "id": 51284,
        "parentId": 48684,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Risk & Capital Model",
        "description": "Risk & Capital Model means a component with a defined methodology written and maintained by the appropriate people as required by the Bank, which is used to generate risk and capital measures.  (Also see Pricing Model, which is used to model financial instruments,  to generate prices and related risk measures).",
        "code": "uri.intranet.db.com/edm/C198",
        "id": 53984,
        "parentId": 48984,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Front Office Risk Measure",
        "description": "Front Office Risk Measure means a measure for which the front office owns the definition.  Includes Present Value, Profit & Loss and Sensitivity Measures.",
        "code": "uri.intranet.db.com/edm/C199",
        "id": 55484,
        "parentId": 49384,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Liquidity Risk Limit",
        "description": "Liquidity Risk Limit means a defined value (often the maximum value), over a defined period, for a liquidity-risk related quantity.",
        "code": "uri.intranet.db.com/edm/C195",
        "id": 56684,
        "parentId": 49584,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Market Risk Limit",
        "description": "Market Risk Limit means a defined value (often the maximum value), over a defined period, for a market-risk related quantity.",
        "code": "uri.intranet.db.com/edm/C194",
        "id": 56784,
        "parentId": 49684,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Operational Risk Limit",
        "description": "Operational Risk Limit means a defined value (often the maximum value), over a defined period, for an operational-risk related quantity.",
        "code": "uri.intranet.db.com/edm/C197",
        "id": 56984,
        "parentId": 49784,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Agreement Data",
        "description": "Subject area including Agreement-related data classes, such as Master Agreement.",
        "code": "uri.intranet.db.com/edm/C200",
        "id": 57084,
        "parentId": null,
        "concrete": false,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Architecture Data",
        "description": "Subject area including data related to business and data architecture, commonly known as 'metadata'.",
        "code": "uri.intranet.db.com/edm/C201",
        "id": 57184,
        "parentId": null,
        "concrete": false,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Enterprise Risk Data",
        "description": "Subject area including data relating to enterprise risks, including Emerging Risk, Location Risk, Leverage Exposure, and Strategic Risk Economic Capital",
        "code": "uri.intranet.db.com/edm/C202",
        "id": 57284,
        "parentId": null,
        "concrete": false,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Information Security Data",
        "description": "Information Security Data represents the core entities and statements which are required to support information security goals (notably confidentiality, integrity, availability and accountability).",
        "code": "uri.intranet.db.com/edm/C203",
        "id": 57384,
        "parentId": null,
        "concrete": false,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Instrument & Asset Data",
        "description": "Subject area including data related to instrument reference data and data related to Assets (such as a property used to secure a loan).  This is data that exists independently of the Deal and is held externally to the Deal.   For example, a property exists independently of a loan secured on that property.",
        "code": "uri.intranet.db.com/edm/C204",
        "id": 57484,
        "parentId": null,
        "concrete": false,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Market Data",
        "description": "Market Data includes price and trade-related data for a financial instrument reported by a trading venue.  This subject also includes information which is derived from the observed price information.",
        "code": "uri.intranet.db.com/edm/C205",
        "id": 57584,
        "parentId": null,
        "concrete": false,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Account Measure",
        "description": "Account Measure represents calculated or derived statistics associated with an  Account, such as volume information or  product usage information.  E.g. number of transactions on an account over a given period.",
        "code": "uri.intranet.db.com/edm/C206",
        "id": 57684,
        "parentId": 33000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Asset Eligibility",
        "description": "The set of rules that are eligible/applicable for each Product Type that is linked to the Agreement. This covers the Interest Rates, WHT Rates, Concentration Rules and Auto Booking Rules for each Product Type.",
        "code": "uri.intranet.db.com/edm/C208",
        "id": 57784,
        "parentId": 36000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Business Process",
        "description": "Business Process means a process that describes the internal behaviour performed by a business role to produce a set of products and services.",
        "code": "uri.intranet.db.com/edm/C209",
        "id": 57884,
        "parentId": 57184,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Collateral Booking",
        "description": "Collateral movement that is agreed to be exchanged.  Note that this is represents a record of the agreed movement, and not the Transaction recording the actual movement.  (In other words, the relationship between Collateral Booking and Transaction is analogous to the relationship between Deal and Transaction).",
        "code": "uri.intranet.db.com/edm/C210",
        "id": 57984,
        "parentId": 36000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Collateral Exposure",
        "description": "Overall collateral exposure (i.e. collateral required) that the bank has at the relevant aggregation level (e.g. for a given Collateral Agreement) before offset by allocated collateral.",
        "code": "uri.intranet.db.com/edm/C211",
        "id": 58084,
        "parentId": 36000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Collateral Settlement Amount",
        "description": "Collateral Settlement Amount is the aggregated value of amounts related to the collateral management process at the relevant aggregation level.  e.g. for a given Account. May include Fees. Coupons, Considerations, and Price Alignment Interest.",
        "code": "uri.intranet.db.com/edm/C212",
        "id": 58184,
        "parentId": 36000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Credit Line",
        "description": "Credit Lines represent aggregation points for credit risk metrics and limits. They allow measurement of aggregate exposure on deals matching the Credit Line Specification, usually those booked under a common banking or trading agreement or with a common counterparty. They are created as part of the Credit Limit Approval process, in response to business proposed by front office.",
        "code": "uri.intranet.db.com/edm/C213",
        "id": 58284,
        "parentId": 49084,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Data Element",
        "description": "Data Element is a unit of data, unique by name and definition, that represents a singular distinct characteristic, quality or property that manifests in the real world (e.g. product name, employee gender, customer telephone number). Typically, a data element exists as a field or a heading in reports and systems. A Data Element is defined by type (alphanumeric, numeric only, true/false, date, etc.). Data Elements are logical, meaning they are independent of system or physical implementation. Data Elements can be found in the Data Dictionary.",
        "code": "uri.intranet.db.com/edm/C216",
        "id": 58384,
        "parentId": 57184,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Requirement",
        "description": "Requirements define the characteristics of a proposed system from the point of view of one or more stakeholders.",
        "code": "uri.intranet.db.com/edm/C217",
        "id": 58484,
        "parentId": 57184,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Data Service",
        "description": "A Data Service is a type of API Service which is responsible for the publication of Datasets according to a Data Service Specification.",
        "code": "uri.intranet.db.com/edm/C218",
        "id": 58584,
        "parentId": 57184,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Collateral Dispute",
        "description": "Amount disagreed with the other party on a margin call.",
        "code": "uri.intranet.db.com/edm/C220",
        "id": 58684,
        "parentId": 36000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Data Model",
        "description": "A Data Model is a set of symbols and text that precisely explains a subset of real information.",
        "code": "uri.intranet.db.com/edm/C221",
        "id": 58784,
        "parentId": 57184,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Instrument Static",
        "description": "Instrument Static represents reference data about an instance of a financial product, such as information on the category and type of security, its unique identification number (e.g. ISIN), as well as other security-related specifics, including the associated general aspects such as tax aspects and regulatory obligations. Since it represents reference data it will typically refer to a fungible, listed product.  This may be the issue of a corporation or government such as a stock or bond.  It may also be a currency, equity, commodity, listed derivative contract or fund. It may also represent an entity that is not tradable in its own right, but is used as the financial basis for the definition of a Product Instance.  For example, an index, or interest rate curve.",
        "code": "uri.intranet.db.com/edm/C224",
        "id": 58884,
        "parentId": 57484,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Model Management Data",
        "description": "Data related to model approvals, limitations, findings and usage",
        "code": "uri.intranet.db.com/edm/C226",
        "id": 58984,
        "parentId": 48984,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Principles & Standards",
        "description": "Principles are general rules and guidelines, intended to be enduring and seldom amended, that inform and support the way on organisation sets about fulfilling its mission.  A Standard defines a level of quality or attainment, designed to underpin a policy or principle.",
        "code": "uri.intranet.db.com/edm/C228",
        "id": 59084,
        "parentId": 57184,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Risk Appetite",
        "description": "Risk appetite is the level of risk that an organization is prepared to accept in pursuit of its objectives, and before action is deemed necessary to reduce the risk.",
        "code": "uri.intranet.db.com/edm/C229",
        "id": 59184,
        "parentId": 48984,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Risk Driver",
        "description": "Risk Drivers identify the underlying causes of specific types of risk.",
        "code": "uri.intranet.db.com/edm/C230",
        "id": 59284,
        "parentId": 48984,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Risk Taxonomy",
        "description": "Risk Taxonomy means reference data supporting classification of risks in a standard way",
        "code": "uri.intranet.db.com/edm/C231",
        "id": 59384,
        "parentId": 48984,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Data Flow",
        "description": "A Data Flow records the logical or physical flow of data from a producer to a consumer.  Includes, for example,  subscriptions which record the intent of an Application Instance to consume data from a Data Service.",
        "code": "uri.intranet.db.com/edm/C232",
        "id": 59484,
        "parentId": 57184,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Enterprise Risk Measure",
        "description": "Enterprise Risk Measure means a risk measure related to activities to gauge and report enterprise risks such as Emerging Risk, Location Risk, Leverage Exposure, and Strategic Risk Economic Capital",
        "code": "uri.intranet.db.com/edm/C234",
        "id": 59584,
        "parentId": 57284,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Risk Scenario",
        "description": "A Risk Scenario identifies a set of economic and market variables (as well as non-market risk factors such as operational risk) used to define and test risk management approaches.",
        "code": "uri.intranet.db.com/edm/C235",
        "id": 59684,
        "parentId": 57284,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Collateral Balance",
        "description": "Collateral Balance Measure is the aggregated post-haircut value of allocated collateral for the relevant aggregation level e.g. Collateral Agreement.",
        "code": "uri.intranet.db.com/edm/C237",
        "id": 59784,
        "parentId": 36000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Authentication Data",
        "description": "Authentication Data represents core facts that are required to establish valid and attestable Digital Identities within IT systems.",
        "code": "uri.intranet.db.com/edm/C250",
        "id": 59884,
        "parentId": 57384,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Authorization Data",
        "description": "Authorization Data represents the core statements which are required to define access rights and enforce access restrictions within IT systems and to IT Assets.",
        "code": "uri.intranet.db.com/edm/C247",
        "id": 59984,
        "parentId": 57384,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Digital Identity",
        "description": "A DB generated Digital Identity comprises the information used to represent an entity (a person, an organization, a device, a subsystem, or a group of such items) in a DB IT system.",
        "code": "uri.intranet.db.com/edm/C245",
        "id": 60084,
        "parentId": 57384,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Information Security Evidence",
        "description": "Information Security (IS) Evidence is used to establish proof about an event or action within an IT system or to provide security-related status information.",
        "code": "uri.intranet.db.com/edm/C253",
        "id": 60184,
        "parentId": 57384,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Information Security Rule",
        "description": "Information Security Rules (IS Rules) are statements which are used to specify, restrict or configure information security related controls.",
        "code": "uri.intranet.db.com/edm/C257",
        "id": 60284,
        "parentId": 57384,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Exception",
        "description": "A record of an error or warning condition",
        "code": "uri.intranet.db.com/edm/C243",
        "id": 60384,
        "parentId": 57184,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Corporate Action Announcement",
        "description": "Corporate Action Announcement represents details of the announcement of a corporate event such as a merger or share split.  Note that it does not represent the Deal Events which are generated as the result of the announcement.  These are represented by the class called Corporate Action.",
        "code": "uri.intranet.db.com/edm/C244",
        "id": 60484,
        "parentId": 57484,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "AFC Risk Measure",
        "description": "AFC Risk Measure means a Risk Measure that represents a measurement of the risk against an AFC-related condition",
        "code": "uri.intranet.db.com/edm/C271",
        "id": 60584,
        "parentId": 63684,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Case",
        "description": "An investigation of a person or entity’s suspicious behaviour undertaken by the surveillance team typically as a result of an alert.",
        "code": "uri.intranet.db.com/edm/C269",
        "id": 60684,
        "parentId": 39000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Compliance Policy Disclosure",
        "description": "Compliance Policy Disclosure refers to the information declared by Staff or prospective Staff for adherence to Compliance Policies. Disclosures could be but not limited to Employee's external interests like Personal Trading Accounts, Investments, Board Memberships or other external roles that may lead to a Conflict of Interest. These could also refer to personal declarations like relationships that need to be declared in accordance with Conduct Risk Policies.",
        "code": "uri.intranet.db.com/edm/C275",
        "id": 60784,
        "parentId": 63784,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "List",
        "description": "A list of entities (that may also include an assigned numeric risk rating) that are compared to an operational dataset that act as indicators for an Alert condition to restrict or prohibit activities from occurring.",
        "code": "uri.intranet.db.com/edm/C259",
        "id": 60884,
        "parentId": 39000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Regulated Roles Registration",
        "description": "Regulated Roles Registration refers to a record of Staff or prospective staff’s Registration with an external party like a Regulator, Official Training or Exam provider for specific regulated roles. This also covers any regulator driven qualifications or Licenses that the staff is expected to possess for executing certain roles within the firm.",
        "code": "uri.intranet.db.com/edm/C276",
        "id": 60984,
        "parentId": 63784,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Scenario",
        "description": "A group of related behaviours that align to business rules, policy or regulation that act as indicators for an alert condition (for example, Wash, Stop/Loss, Partial Fills, TAME, Spoofing, Layering).",
        "code": "uri.intranet.db.com/edm/C277",
        "id": 61084,
        "parentId": 39000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "AFC Segmentation",
        "description": "Segmentation is the process of dividing accounts into groups, or segments, based on different characteristics. The segments created are composed of accounts which share traits such as similar risks measures. These risk measures could be based on inputs such as account risk rating, past alert activity and the domiciled country.",
        "code": "uri.intranet.db.com/edm/C270",
        "id": 61184,
        "parentId": 63684,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Signal",
        "description": "A Signal is an indicator, depicting the deviation to a trend or characteristic of measured variables in a category of variables like Traded Instrument  prices, Human initiated actions, Market behaviour that results in a potential Compliance Alert.",
        "code": "uri.intranet.db.com/edm/C266",
        "id": 61284,
        "parentId": 39000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Suspicious Activity Report",
        "description": "A Suspicious Activity Report (SAR) is a document that financial institutions must file with the Financial Crimes Enforcement Network (FinCEN) following a suspected incident of money laundering or fraud. These reports are required under the United States Bank Secrecy Act (BSA) of 1970.",
        "code": "uri.intranet.db.com/edm/C274",
        "id": 61384,
        "parentId": 63684,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Master Agreement",
        "description": "A Master Agreement is a contract reached between parties, in which the parties agree to most of the terms that will govern future transactions or future agreements.",
        "code": "uri.intranet.db.com/edm/C225",
        "id": 61484,
        "parentId": 33300,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Attestation Data",
        "description": "Attestation Data represents a proof of a successful authentication or authorization.",
        "code": "uri.intranet.db.com/edm/C252",
        "id": 61584,
        "parentId": 59884,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Authentication Credentials",
        "description": "Authentication Credentials are the information that an entity needs to provide in order to validate its Digital Identity.",
        "code": "uri.intranet.db.com/edm/C251",
        "id": 61684,
        "parentId": 59884,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Access Assignment",
        "description": "Access Assignments represent the managed relationships between User Accounts and Entitlements/Access Roles and also between Access Roles and Entitlements.",
        "code": "uri.intranet.db.com/edm/C248",
        "id": 61784,
        "parentId": 59984,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Access Role",
        "description": "An Access Role summarizes one or more Entitlements and provides access to one or more IT Assets. The notion of an Access Role also covers business roles which represent one or more business functions.",
        "code": "uri.intranet.db.com/edm/C239",
        "id": 61884,
        "parentId": 59984,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Authorization Rule",
        "description": "Authorization Rules are specifications of access rights. The rules are based on properties or attributes of IT Assets, entities and environmental factors.",
        "code": "uri.intranet.db.com/edm/C249",
        "id": 61984,
        "parentId": 59984,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Entitlement",
        "description": "An Entitlement is a predefined access right that grants permission for a User Account to an IT Assets. An Entitlement may be assigned to User Accounts or to Access Roles.",
        "code": "uri.intranet.db.com/edm/C241",
        "id": 62084,
        "parentId": 59984,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "User Account",
        "description": "A User Account is the identifier with which individuals or IT Assets identify themselves on an IT Asset. A User Account may be an Individual User Account, a Shared Account, a Service Account or a Robot User Account.",
        "code": "uri.intranet.db.com/edm/C246",
        "id": 62184,
        "parentId": 60084,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Information Security Risk & Compliance Data",
        "description": "The Information Security (IS) Risk & Compliance Data provides a detailed view of the information security related risk or compliance status of IT Assets.",
        "code": "uri.intranet.db.com/edm/C255",
        "id": 62284,
        "parentId": 60184,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Privileged Access Log",
        "description": "The log documents user activities within IT systems that are executed with privileged access rights and thus high risks. The log assures that unusual, unexpected, or malicious activities are documented and can be escalated for investigation.",
        "code": "uri.intranet.db.com/edm/C256",
        "id": 62384,
        "parentId": 60184,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Review Evidence",
        "description": "Review Evidence is used to establish proof that a review has been executed. It includes results of the review or assessment.",
        "code": "uri.intranet.db.com/edm/C254",
        "id": 62484,
        "parentId": 60184,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "SoD Rule",
        "description": "A Segregation of Duties Rule (SoD Rule) specifies which access rights are incompatible or form toxic combinations. \r\nSoD Rules support that access rights of individuals fulfill compliance and security requirements.",
        "code": "uri.intranet.db.com/edm/C258",
        "id": 62584,
        "parentId": 60284,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "AFC Case",
        "description": "An investigation of a person or entity’s suspicious behaviour undertaken by the Financial Crime Operations (FCO) team typically as a result of an AFC Alert.",
        "code": "uri.intranet.db.com/edm/C267",
        "id": 62684,
        "parentId": 63684,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Compliance Case",
        "description": "An investigation of a person or entity’s suspicious behaviour undertaken by the Compliance Surveillance typically as a result of an Compliance Alert.",
        "code": "uri.intranet.db.com/edm/C268",
        "id": 62784,
        "parentId": 63784,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "AFC List",
        "description": "A list of entities (that may also include an assigned numeric risk rating) that are compared to an operational dataset that act as indicators for an AFC Alert condition to restrict or prohibit activities from occurring (for example, Sanctions & Embargos, Watchlists, Internal).",
        "code": "uri.intranet.db.com/edm/C262",
        "id": 62884,
        "parentId": 63684,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Compliance List",
        "description": "A list of entities (that may also include an assigned numeric risk rating) that are compared to an operational dataset that act as indicators for an Compliance Alert condition to restrict or prohibit activities from occurring (for example, Control Room, Restricted).",
        "code": "uri.intranet.db.com/edm/C263",
        "id": 62984,
        "parentId": 63784,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "AFC Scenario",
        "description": "A group of related behaviours that align to business rules, policy or regulation that act as indicators for an AFC Alert condition (for example, High Risk Geographies, Hidden Relationships, Change In Behaviour, High Risk Entity, Rapid Movement of Funds, and Other Money Laundering Behaviour).",
        "code": "uri.intranet.db.com/edm/C260",
        "id": 63084,
        "parentId": 63684,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Compliance Scenario",
        "description": "A group of related behaviours that align to business rules, policy or regulation that act as indicators for an Compliance Alert condition (for example, Wash, Stop/Loss, Partial Fills, TAME, Spoofing, Layering).",
        "code": "uri.intranet.db.com/edm/C261",
        "id": 63184,
        "parentId": 63784,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "DEPRECATED - Account Segmentation",
        "description": "Account segmentation is the process of dividing accounts into groups, or segments, based on different characteristics. The segments created are composed of accounts which share traits such as similar risks measures. These risk measures could be based on inputs such as account risk rating, past alert activity and the domiciled country.",
        "code": "uri.intranet.db.com/edm/C273",
        "id": 63284,
        "parentId": 61184,
        "concrete": true,
        "deprecated": true,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "DEPRECATED - Customer Segmentation",
        "description": "Customer segmentation is the process of dividing customers into groups, or segments, based on different characteristics. A customer can be allocated multiple segments based in inputs such as customer type, products and past activity.",
        "code": "uri.intranet.db.com/edm/C272",
        "id": 63384,
        "parentId": 61184,
        "concrete": true,
        "deprecated": true,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "AFC Signal",
        "description": "An AFC Signal is an indicator, depicting the deviation to a trend or characteristic of measured variables in a category of variables like  terrorist financing events, gifts and entertainment events, MTA or NSB events, external card payment events, daily media events, ABC advisory events that results in a potential AFC Alert",
        "code": "uri.intranet.db.com/edm/C264",
        "id": 63484,
        "parentId": 63684,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Compliance Signal",
        "description": "A Compliance Signal is an indicator, depicting the deviation to a trend or characteristic of measured variables in a category of variables like Traded Instrument  prices, Human initiated actions, Market behaviour that results in a potential Compliance Alert",
        "code": "uri.intranet.db.com/edm/C265",
        "id": 63584,
        "parentId": 63784,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Anti-Financial Crime Data",
        "description": "Subject area including data related to the management of Financial Crime Risks including  Transaction Monitoring, Transaction Filtering, Name Screening, List Management, Client Risk Rating, Intelligence, Anti-Bribery & Corruption Monitoring and Fraud Surveillance",
        "code": "uri.intranet.db.com/edm/C292",
        "id": 63684,
        "parentId": null,
        "concrete": false,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Compliance Data",
        "description": "Subject area including data related to the management of Compliance Risks including Surveillance (Trade/Voice/Comms), Employee Compliance, Position Reporting, Conduct Risk, Control Room, Cross Border, Business Line Compliance and Regional Compliance",
        "code": "uri.intranet.db.com/edm/C293",
        "id": 63784,
        "parentId": null,
        "concrete": false,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Investment Management Data",
        "description": "This subject area contains data related to invesment management activities such as pricing of funds and measurement of investment performance.",
        "code": "uri.intranet.db.com/edm/C295",
        "id": 63884,
        "parentId": null,
        "concrete": false,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Legal Data",
        "description": "Subject area including legal-related data such as Legal Matters, Legal Holds, Legal Know How and Regulation & Policy.",
        "code": "uri.intranet.db.com/edm/C294",
        "id": 63984,
        "parentId": null,
        "concrete": false,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Information Barrier Designation",
        "description": "Information Barriers are internal organizational arrangements which serve to prevent the inappropriate or unauthorized communication of information between or amongst employees of different DB business areas. This is a key mechanism by which DB ensures its clients' interests are protected and any potential conflicts are managed.",
        "code": "uri.intranet.db.com/edm/C299",
        "id": 64084,
        "parentId": 63784,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Banking Account",
        "description": "An account that supports tracking the balance of a Product Instance, or supports the operational processes around provision of products to clients.",
        "code": "uri.intranet.db.com/edm/C278",
        "id": 64184,
        "parentId": 34000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Investment Acccounting Data",
        "description": "Investment Accounting Data represents the data required to calculate fund prices and issued units, such as NAV, income equalisation, number of units in issue.",
        "code": "uri.intranet.db.com/edm/C296",
        "id": 64284,
        "parentId": 63884,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Performance Measurement Data",
        "description": "Performance Measurement Data represents data resulting from measuring the performance of a set of assets under management against one or more benchmarks.",
        "code": "uri.intranet.db.com/edm/C297",
        "id": 64384,
        "parentId": 63884,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Party Alternative Identifier",
        "description": "The Party Alternative Identifier is a unique identifier for a Party that is an alternative to the (DB) strategic identifier. The Alternative Identifier could be from an internal or external source e.g. internal where there are multiple masters or legacy identifiers, and external, such as the LEI (Legal Entity Identifier operated by the Global LEI system). Where the Alternative Identifier is internal, a reference to the internal system responsible for mastering the Alternative Identifier might be provided.",
        "code": "uri.intranet.db.com/edm/C289",
        "id": 64484,
        "parentId": 33000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Party Consent",
        "description": "Any consent related data given by a Party.  For example:\r\n- Client approval, that bank is allowed to receive all client related data in terms of loans granted by other banks etc., \r\n- Opt-In, \r\n- GDPR",
        "code": "uri.intranet.db.com/edm/C291",
        "id": 64584,
        "parentId": 33000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Party Contact Method",
        "description": "Party Contact Method is the form of communication available to contact a Party.  Different contact methods might be used for different purposes e.g. different addresses might be used by a Party for various situations, including registration, domicile, operation, mailing.",
        "code": "uri.intranet.db.com/edm/C290",
        "id": 64684,
        "parentId": 33000,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Sales Web Data",
        "description": "Collection of data regarding clients / non-clients activities visiting web sites owned by DB or by DB-related subsidiaries and also on external web sites with ad banners placed by DB.\r\nThe classification in clients and non-clients depends on the success if available web data can be associated with existing clients data in DB backend systems or convert prospects to new clients.\r\nActivities of web sites visitors are tracked and observed (in terms of marketing funnel, termination rate etc.) in order to find out in what web visitors are interested in (product information, pricing, (branch)-contact etc.) and to support them to meet their needs and finally to increase business (e.g. conclusion of contracts or products).\r\nDepending on the purpose various kinds of data are collected, merged and analyzed. After analysis web sites visitors are contacted to complete conversion like specific needs, products etc.",
        "code": "uri.intranet.db.com/edm/C298",
        "id": 64784,
        "parentId": 40600,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Processing Account",
        "description": "A Processing Account is an account, such as for example a control account, that supports the operational processes around provision of products to clients, in particular, settlement, clearing and collateral management.   Apart from Nostro accounts, the balance on these accounts will normally be zero once the processing is complete.",
        "code": "uri.intranet.db.com/edm/C280",
        "id": 64884,
        "parentId": 64184,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Product Account",
        "description": "Product Accounts are client-facing accounts that are created to support tracking the balance of one or more Product Instances.",
        "code": "uri.intranet.db.com/edm/C279",
        "id": 64984,
        "parentId": 64184,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Card Product",
        "description": "A Card Product is a payment service that is offered to our Customers that relates to either a debit or a credit card.",
        "code": "uri.intranet.db.com/edm/C281",
        "id": 65084,
        "parentId": 37100,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Sales Advertising Data",
        "description": "AD DATA focus mainly on Ad Exchange and Ads Placement on external websites. \r\nAD EXCHANGE and PLACEMENT is a technology platform / market places that facilitates the buying and selling product and services. Ad Exchange contains data about Ad Impression (one sucessful ad call), Ad Coverage, Ad Monetized Pageviews, Ad Viewable Impressions, Ad Clicks etc.\r\n\r\nAD SENSE for example is a tool that allows publishers in a Network of content sites to serve automatic text, image, video, or interactive media advertisements, that are targeted to site content and audience. These advertisements are administered, sorted, and maintained by erxternal provider (e.g. from Google).",
        "code": "uri.intranet.db.com/edm/C288",
        "id": 65184,
        "parentId": 64784,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Sales Geodata",
        "description": "GEO DATA can be subdivided into two groups Geo Network and Socio Demographic Data.\r\nGEO NETWORK Data describe different kinds of geographical data as Continent, Country, specific Region, City followed by Market Area, Network Domain and Service Provider. Data derived from users' IP addresses or Geographical IDs.\r\nSOCIO-DEMOGRAPHIC data are focussing on the identification and determation of target audience. \r\nBased on (total) population geographical distribution of people including population characteristics and activity levels, aggregated by grid and region, target audience is analyized in order to create marketing campaigns. Overall target: Identify groups of individuals od like-minded people based on simular view of life, sharing the same values, income etc. (Sinus-Milieus Studies / Empirical Social Research)",
        "code": "uri.intranet.db.com/edm/C283",
        "id": 65284,
        "parentId": 64784,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Sales Online Conversion Data",
        "description": "AN ONLINE CONVERSION takes place when a web visitor / consumer complete a specific action you are tracking (conclusion of contract, buy product, register an account, sign in for newsletter etc.)\r\n\r\nONLINE CONVERSION DATA can be subdivided into two groups Goal Conversion and Ecommerce.\r\nGOAL CONVERSION data collect data as Goal Starts & Goal Completion, Goal Value, Conversion Rate (The percentage of sessions which resulted in a conversion) and Goal Completion Location etc.. \r\nFinally also the rate at which the requested goal number was abandoned (Abandonment Rate) and the overall number of times users started goals without actually completing them (Abandoned Funnel).\r\nECOMMERCE provides data about the Tranaction ID, Product Affiliation (promoting produts by other company's) as well as Session to transaction, Day to Transaction, Product & Product Category, Currency,  Shopping Stage, Promotion etc.",
        "code": "uri.intranet.db.com/edm/C285",
        "id": 65384,
        "parentId": 64784,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Sales Platform or Device Data",
        "description": "Data collection regarding DEVICES mainly covers information about all kinds of physical devices like desktop, tablet, mobile and also information about device manufactorer and branded name et al  \r\nData regarding PLATFORM are focussing on information about Operating-System (Windows, Linux, Macintosh, or iOS) and its Version as well as Browser-Name and -Version.",
        "code": "uri.intranet.db.com/edm/C282",
        "id": 65484,
        "parentId": 64784,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Sales Tracking Data",
        "description": "The term marketing or online tracking describes the the logging of visitors or consumers interaction and engagement, to form predictions about future behaviors. Tracking helps to understand e.g. from which link a web visitor came to a specific page (how consumer found web site), the number of visitor or consumer on a web site, how visitor or consumer interact on web site, for how long the visitor or consumer stayed on web site, the web visitor IP address etc.. \r\nDifferent TRACKING DATA typs exist as click-, mouse-, event-, app-, eye-tracking etc. \r\nRegarding APP Tracking data as app name, version and installer ID are collected.\r\nIn terms of EVENT Tracking the Event Category, Event Action and Event Label are logged for further analysis etc\r\nIn terms of PAGE Tracking the hostname from which the tracking request was made is logged. A page on the website is specified by path and (or) query parameters. Option: Use this with the hostname to get the full URL Page (Path, Page Title, Landing Page, Second Page, Exit-Page etc.)\r\nIn terms of TRAFFIC SOURCE information about path of referring URL and also including hostname (Referring Path), Campaign, Campaign Code, Source and Medium, Name of social network and Keyword for manual campaign tracking) are collected.\r\nINTERNET SEARCH contains data about search status (Boolean visits with or without Site Search), terms, keywords and product categories used for internet seach by web-visitors or consumers.",
        "code": "uri.intranet.db.com/edm/C286",
        "id": 65584,
        "parentId": 64784,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Sales User Data",
        "description": "USER DATA can be subdivided into two groups User & Audience and Lifetime Value or Acquisition & Cohorts Data.\r\nAUDIENCE data encompass information about the individual person as follows: Age, Gender, Affinity Category  and also the In-Market Segment.\r\nUSER data include user-related information: User Type, Count of Sessions, Days since last Session, User defined Value, User Bucket \r\nCOHORT is the name of the cohort to which a user belongs. Depending on how cohorts are defined, a user can belong to multiple cohorts, similar to how a user can belong to multiple segments.\r\nACQUISITION related data describe information through which users were required such as campiagn, medium, source, channel (e.g. Acquisition Campaign = The campaign through which users were acquired, derived from users' first session).",
        "code": "uri.intranet.db.com/edm/C284",
        "id": 65684,
        "parentId": 64784,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    },
    {
        "name": "Sales Web Sites & Session Data",
        "description": "WEB SITE & SESSION DATA can be subdivided into two groups Site Speed Data and Session & Time Data.\r\nSITE SPEED & PERFORMANCE data contain various kinds of time-related measures in terms of page and network. The Page Load Time measures the total time from pageview initiation (e.g. a click on a page link) to page load completion in the browser (in milliseconds). The Page Download Time is the the total time to download this page among all samples. In terms of network additionally time options are measured by Domain Lockup Time, Server Connection Time, Server Response Time, Document Interactive Time, Document Content Loading Time etc.\r\nSESSION & TIME data measure different matters around session duration, total numbers of sessions, the total number of interaction hits (bounce) and the percentage of single-page session, in which the person left the property from the first page (bounce rate).",
        "code": "uri.intranet.db.com/edm/C287",
        "id": 65784,
        "parentId": 64784,
        "concrete": true,
        "deprecated": false,
        "kind": "DATA_TYPE",
        "unknown": false
    }
]